&НаКлиенте
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ОбъектыНазначенияМассив) Экспорт
	
	ТД = ВладелецФормы.Элементы.Хозрасчетный.ТекущиеДанные;
	
	ТекЭлемент = ВладелецФормы.ТекущийЭлемент;
	
	Если ТекЭлемент.Имя <> "Хозрасчетный" Или
			ТипЗнч(ТД[СтрЗаменить(ТекЭлемент.ТекущийЭлемент.Имя, "Хозрасчетный", "")]) <> Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		Сообщить("Необходимо выбрать строку и поле для подстановки договора на закладке ""Бухгалтерсий и налоговый учет""");
		Возврат;
	ИначеЕсли ТД.СчетДт <> ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.бит_стр_МатериалыПереданныеНаСторонуПереработчику") Тогда
		Сообщить("Операция возможна только для субконто счета Дт 003.05");
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Справочник.ДоговорыКонтрагентов.ФормаВыбора",, ЭтаФорма, Истина,,, Новый ОписаниеОповещения("ВыборДоговораПродолжение", ЭтаФорма), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
			
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВернутьИмяРеквизитаДоговорРегистра(ИмяРегистра, ТипРегистра)
	
	Если ТипРегистра = "РегистрНакопления" Тогда
		Измерения = Метаданные[СтрЗаменить(ТипРегистра, "Регистр", "Регистры")][ИмяРегистра].Измерения;
		
		Для Каждого Измерение Из Измерения Цикл
			Если Измерение.Тип.СодержитТип(Тип("СправочникСсылка.ДоговорыКонтрагентов")) Тогда
				Возврат Измерение.Имя;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ВыборДоговораПродолжение(Договор, ДопПараметры) Экспорт
	Если Договор = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ТекЭлемент = ВладелецФормы.ТекущийЭлемент;

	ТекПоле = ТекЭлемент.ТекущийЭлемент.Имя;
	
	ТД = ВладелецФормы.Элементы.Хозрасчетный.ТекущиеДанные;
	
	ТД[СтрЗаменить(ТекПоле, "Хозрасчетный", "")] = Договор;
	
	ВладелецФормы.Модифицированность = Истина;
	
	СтрОтбор = Новый Структура("Отображение", Истина);
	
	НайдРегистры = ВладелецФормы.Регистры.НайтиСтроки(СтрОтбор);
	
	Если НайдРегистры.Количество() Тогда
		
		Для Каждого НайдРегистр Из НайдРегистры Цикл
			Если НайдРегистр.Имя = "Хозрасчетный" Тогда
				Продолжить;
			КонецЕсли;
			
			ИмяРеквизитаДоговор = ВернутьИмяРеквизитаДоговорРегистра(НайдРегистр.Имя, НайдРегистр.ТипРегистра);
			
			Если НайдРегистр.Имя = "прм_УчетСтоимостиДавальческогоСырья" Тогда 
				СтрОтбор = Новый Структура("НомерСтроки, Стоимость", ТД.НомерСтроки, ТД.Сумма);
				НайдСтроки = ВладелецФормы[НайдРегистр.Имя+"НаборЗаписей"].НайтиСтроки(СтрОтбор);
				
				Если НайдСтроки.Количество() = 0 Тогда
					Сообщить(СтрШаблон("Для строки %1 не найдена строка в регистре %2", ТД.НомерСтроки, НайдРегистр.Имя));
				КонецЕсли;
				
				Для Каждого НайдСтрока Из НайдСтроки Цикл
					НайдСтрока[ИмяРеквизитаДоговор] = Договор;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры